Repository: elementary/granite
Catalog: po/extra/*.po
Languages: de, es, sv

source: Build consistent and usable apps more quickly and easily
de: Einheitliche und benutzerfreundliche Apps schneller und einfacher erstellen
es: Cree aplicaciones consistentes y fáciles de usar de manera más rápida y sencilla
sv: Skapa konsekventa och användbara appar snabbare och enklare

source: A companion library for GTK and GLib that provides complex widgets and convenience methods designed for use in apps built for elementary OS.
de: Eine Begleitbibliothek für GTK und GLib, die komplexe Widgets und benutzerfreundliche Methoden bereitstellt, und die zur Verwendung in Anwendungen für elementaryOS entwickelt wurde.
es: Una biblioteca complementaria para GTK y GLib que proporciona widgets complejos y métodos de conveniencia diseñados para su uso en aplicaciones para elementary OS.
sv: Ett kompletterande bibliotek för GTK och GLib som tillhandahåller komplexa widgetar och bekvämlighetsmetoder avsedda att användas i appar som byggts för elementary OS.

source: Improvements:
de: Verbesserungen:
es: Mejoras:
sv: Förbättringar:

source: HeaderLabel now has ellipsize property
es: La etiqueta de encabezado («HeaderLabel») ahora tiene una propiedad («ellipsize») para permitir dibujar puntos suspensivos cuando un texto no cabe
sv: HeaderLabel har nu ellipsize-egenskap

source: ListItem now has a menu_model property
es: «ListItem» ahora tiene una propiedad «menu_model»
sv: ListItem har nu en menu_model-egenskap

source: Updated translations
de: Aktualisierte Übersetzungen
es: Traducciones actualizadas
sv: Uppdaterade översättningar

source: New Icons:
es: Se agregaron nuevos iconos:
sv: Nya ikoner:

source: View icons for columns, grids, lists, and reader mode. Plus horizontal and vertical ellipsis icons
es: Iconos de vista de columnas, grillas, listas y modo lectura. Además de nuevos iconos de elipsis horizontal y vertical
sv: Visa ikoner för kolumner, rutnät, listor och läsarläge. Plus horisontella och vertikala ellipsikoner

source: Start and End show/hide sidebar icons
es: Iconos de inicio y fin para mostrar/quitar barras laterales
sv: Start och Slut visar/döljer ikoner i sidofältet

source: Emoji category icons used by GTK's emoji picker
es: Iconos de categorías de emojis utilizados por el panel de selección de emojis de GTK
sv: Ikoner för emoji-kategorier som används av GTK:s emoji-väljare

source: Eye icons required by Gtk.PasswordEntry
es: Iconos de ojos, requeridos por «Gtk.PasswordEntry»
sv: Ögonikoner som krävs av Gtk.PasswordEntry

source: New Features:
de: Neue Funktionen:
es: Nuevas características:
sv: Nya funktioner:

source: Box is an orientable widget that includes standardized spacing and linked styles
es: Se agregó «Box», un widget orientable que incluye espaciado estandarizado y estilos de enlaces
sv: Box är en orienterbar widget som innehåller standardiserade avstånd och länkade stilar

source: ListItem is a standard list widget that includes styles and spacing
es: Se agregó «ListItem», un widget estándar de listas que incluye estilos y espaciado
sv: ListItem är en standardwidget för listor som innehåller stilar och avstånd

source: ToolBox is a vertical layout widget for top and bottom toolbars
es: Se agregó «ToolBox», un widget de distribución vertical para barra de herramientas arriba y abajo de una ventana
sv: ToolBox är en widget med vertikal layout för övre och nedre verktygsfält

source: new style class constants for labels: CssClass.NUMERIC and CssClass.MONOSPACE
es: Hay nuevas constantes de clases de estilo para etiquetas: «CssClass.NUMERIC» y «CssClass.MONOSPACE»
sv: nya stilklasskonstanter för etiketter: CssClass.NUMERIC och CssClass.MONOSPACE

source: StyleManager handles automatically setting dark and light modes as well as system accent colors using Portals
es: Se agregó «StyleManager» que administra automáticamente la configuración de modo claro y oscuro, así como los colores de énfasis utilizando Portales
sv: StyleManager hanterar automatisk inställning av mörka och ljusa lägen samt systemets accentfärger med hjälp av Portaler

source: BackButton is a standardized navigation button that activates "navigation.pop" and includes a shortcut tooltip
es: Se agregó «BackButton», un botón estándar de navegación que activa «navigation.pop» e incluye una etiqueta emergente para mostrar atajos
sv: BackButton är en standardiserad navigeringsknapp som aktiverar "navigation.pop" och innehåller en verktygstips för genvägar

source: accel_to_string now uses the word "Super" instead of the "⌘" symbol
es: Ahora «accel_to_string» utiliza la palabra «Super» en vez del símbolo «⌘»
sv: accel_to_string använder nu ordet "Super" istället för symbolen "⌘"

source: HeaderLabel has a new property for H1-H4 sizes and H2 styles are now bolder
es: Ahora «HeaderLabel» tiene una nueva propiedad para tamaños H1-H4. También los estilos H2 tiene una negrita más destacada
sv: HeaderLabel har en ny egenskap för H1-H4-storlekar och H2-stilarna är nu fetare

source: CssClass.CARD is now rounded by default
es: Ahora la clase «CssClass.CARD» es redondeada por defecto
sv: CssClass.CARD är nu rundad som standard

source: Deprecations:
de: Verfallshinweise:
es: En desuso:
sv: Föråldrade:

source: Utils.set_color_primary. Modern apps have moved to more of a split paned design and this style is no longer very fashionable
es: «Utils.set_color_primary» se considera obsoleto. Las aplicaciones modernas ahora prefieren un estilo de panel dividido y este estilo ya no se encuentra muy de moda
sv: Utils.set_color_primary. Moderna appar har gått över till en mer delad design och den här stilen är inte längre särskilt modern

source: Nearly all of the old `STYLE_CLASS` constants have been deprecated. Some of them have been replaced by `CssClass` constants, others by widgets.
es: Casia todas las antiguas constantes de tipo «STYLE_CLASS« se han marcado como obsoletas. Algunas de ellas se han reemplazado por constantes «CssClass», otras por widgets.
sv: Nästan alla de gamla `STYLE_CLASS`-konstanterna har blivit föråldrade. Några av dem har ersatts av `CssClass`-konstanter, andra av widgetar.

source: Demo Improvements:
es: Mejoras respecto a la aplicación de demostración:
sv: Demoförbättringar:

source: More demo pages with more widgets
es: Se agregaron más páginas de demostración y más widgets
sv: Fler demosidor med fler widgetar

source: Color scheme switcher in the sidebar
es: Se agregó un selector de esquemas de colores en la barra lateral
sv: Färgschemaväxlare i sidofältet

source: Improve screen reader support for SwitchModelButton
es: Se mejoró la computabilidad de los lectores de pantalla para el botón de alternancia modal (SwitchModelButton)
sv: Förbättra skärmläsarstödet för SwitchModelButton

source: Wrap long labels for SwitchModelButton
es: Ahora se hace un ajuste de línea para etiquetas muy largas para el SwitchModelButton
sv: Radbryt långa etiketter för SwitchModelButton

source: HeaderLabel: set accessible description
es: Etiqueta de encabezado (HeaderLabel): Se asignó una descripción accesible
sv: HeaderLabel: ange tillgänglig beskrivning

source: ValidatedEntry: set AccessibleState for validity
es: Entrada de validación (ValidatedEntry): se agregó una propiedad (AccessibleState) para comprobar su validez
sv: ValidatedEntry: ange AccessibleState för giltighet

source: Toast: add a new dismissed signal that includes the reason for dismissal
es: Mensajes emergentes (Toast): se ha agregado una nueva señal descartada que incluye la razón del descarte
sv: Toast: lägg till en ny avfärdningssignal som innehåller orsaken till avfärdningen

source: Add STYLE_CLASS_SUCCESS
es: Se ha agregado STYLE_CLASS_SUCCESS
sv: Lägg till STYLE_CLASS_SUCCESS

source: HeaderLabel: allow secondary text to use markup
es: Etiquetas de encabezado (HeaderLabel): ahora se permite que el texto secundario use lenguaje de marcado
sv: HeaderLabel: tillåt sekundär text att använda markup

source: Make building Demo optional
es: Compilar la demostración ahora es opcional
sv: Gör det valfritt att bygga Demo

source: Demo now uses a modern split-pane design
es: La demostración ahora utiliza un diseño de panel dividido moderno
sv: Demo använder nu en modern design med delade paneler

source: DateTime: handle relative datetime when epoch
es: Fecha y hora (DateTime): ahora se usan fechas relativas cuando se utilice tiempo de época (epoch)
sv: DateTime: hantera relativ datatid när epoch

source: MessageDialog: Set last button as focus widget
es: Cuadro de mensaje (MessageDialog): Ahora se asigna el último botón como widget para enfocar
sv: MessageDialog: Ange den sista knappen som fokuswidget

source: SwitchModelButton: Remove redundant switch keyboard focusing
es: Botón de alternancia con texto (SwitchModelButton): Se eliminó una redundancia al cambiar de foco con el teclado
sv: SwitchModelButton: Ta bort överflödig växling av tangentbordsfokusering

source: Load fallback styles for widgets when using Granite.init
es: Ahora se cargan estilos alternativos para widgets cuando se utiliza Granite.Init
sv: Läs in reservstilar för widgetar när du använder Granite.init

source: SettingsPage and SettingsSidebar: these widgets have moved to LibSwitchboard
es: Página de configuraciones (SettingsPage) y barra de configuraciones (SettingsSidebar): estos widgets se han movido a LibSwitchbaord
sv: SettingsPage och SettingsSidebar: dessa widgetar har flyttats till LibSwitchboard

source: Add a withdraw method for Granite.Toast
es: Se ha agregado un método de «retirar» (withdraw) para Granite.Toast
sv: Lägg till en uttagsmetod för Granite.Toast

source: Don't depend on the elementary stylesheet for fallback styles
es: Ya no se depende de la hoja de estilos de elementary para estilos alternativos
sv: Var inte beroende av elementary-stilmallen för reservstilar

source: Automatically load gresourced stylesheets named "Application.css" on "Granite.init ()"
es: Ahora se cargan automáticamente las hojas de estilos de «gresource» llamadas «Application.css» al invocar «Granite.init ()»
sv: Läs automatiskt in gresourcade-formatmallar med namnet "Application.css" på "Granite.init ()"

source: Add SettingsUri constants for launching System Settings
es: Se agregan constantes en «SettingsUri» para poder lanzar la Configuración de Sistema
sv: Lägg till SettingsUri-konstanter för att starta systeminställningar

source: Make "Granite.init ()" publicly available
es: El método «Granite.init ()» ahora es público
sv: Gör "Granite.init ()" allmänt tillgänglig

source: Granite.STYLE_CLASS_RICH_LIST for standard Gtk.ListBox row padding
es: Se agrega Granite.STYLE_CLASS_RICH_LIST para crear espaciado estándar en Gtk.ListBox
sv: Granite.STYLE_CLASS_RICH_LIST för standard Gtk.ListBox radutfyllnad

source: Granite.STYLE_CLASS_FRAME for adding a border to Gtk.LisBox, Gtk.InfoBar, and others
es: Se agrega Granite.STYLE_CLASS_FRAME para añadir un borde a Gtk.LisBox, Gtk.InfoBar, entre otros
sv: Granite.STYLE_CLASS_FRAME för att lägga till en ram till Gtk.LisBox, Gtk.InfoBar och andra

source: Granite.STYLE_CLASS_SIDEBAR for styling application sidebars
es: Se agrega Granite.STYLE_CLASS_SIDEBAR para dar estilo a las barras laterales de las aplicaciones
sv: Granite.STYLE_CLASS_SIDEBAR för styling av sidofält i program

source: Granite.STYLE_CLASS_BACKGROUND to use the default background color for a widget
es: Se agrega Granite.STYLE_CLASS_BACKGROUND para utilizar un color de fondo predeterminado para un widget
sv: Granite.STYLE_CLASS_BACKGROUND för att använda standardbakgrundsfärgen för en widget

source: Add optional secondary text to Granite.HeaderLabel
es: Se agrega un texto secundario opcional a las etiquetas de encabezado (Granite.HeaderLabel)
sv: Lägg till valfri sekundär text till Granite.HeaderLabel

source: Allow text in Granite.Toast to wrap
es: Se permite que a los mensajes emergentes (Granite.Toast) se pueda ajustar el texto
sv: Tillåt texten i Granite.Toast att radbrytas

source: SimpleSettingsPage: Wrap titles and allow description text to go under switches
es: Página de configuración simple (SimpleSettingsPage): Los títulos se ajustan y se permite que los botones de alternancia tengan textos descriptivos debajo
sv: SimpleSettingsPage: Radbryt titlar och tillåt beskrivningstexten gå under växlar

source: Ported to GTK4! 🎉️
es: ¡Portado a GTK4! 🎉️
sv: Portad till GTK4! 🎉️

source: Granite.Placeholder: replaces AlertView and Welcome
es: Marcador temporal (Granite.Placeholder): remplaza los widgets de AlertView y Welcome
sv: Granite.Placeholder: ersätter AlertView och Welcome

source: SimpleSettingsPage: Allow markup in description
es: Página de configuración simple (SimpleSettingsPage): Se permite texto de marcado en la descripción
sv: SimpleSettingsPage: Tillåt markup i beskrivning

source: Removals:
de: Entfernt:
es: Iconos retirados:
sv: Borttagningar:

source: Application: use Gtk.Application instead
es: Application (Application): Use Gtk.Application en su lugar
sv: Program: använd Gtk.Application istället

source: Drawing: Use Gtk.CSS
es: Dibujo (Drawing): Utilice Gtk.CSS en su lugar
sv: Ritning: Använd Gtk.CSS

source: DynamicNotebook: use Adw.TabBar instead
es: Bloc de notas dinámico (DynamicNotebook): Use Adw.TabBar en su lugar
sv: DynamicNotebook: använd Adw.TabBar istället

source: Logger: use GLib.log instead
es: Logger: use GLib.log en su lugar
sv: Logger: använd GLib.log istället

source: ModeButton: Use Gtk.ToggleButton with the "group" property and "linked" style class instead
es: Botón de alternancia (ModeButton): Utilice Gtk.ToggleButton con la propiedad «group» y estilo «linked» en su lugar
sv: ModeButton: Använd Gtk.ToggleButton med egenskapen "group" och stilklassen "linked" istället

source: Paths: use GLib.Environment instead
es: Rutas de sistema (Paths): utilice GLib.Environment en su lugar
sv: Sökvägar: använd GLib.Environment istället

source: Seekbar
es: Barra de búsqueda (Seekbar)
sv: Sökfält

source: Services.Settings: use GLib.Settings instead
es: Servicios de configuración (Services.Settings): utilice GLib.Settings en su lugar
sv: Services.Settings: använd GLib.Settings istället

source: SimpleCommand: use GLib.AppInfo.create_from_commandline instead
es: Comando simple (SimpleCommand): utilice GLib.AppInfo.create_from_commandline en su lugar
sv: SimpleCommand: använd GLib.AppInfo.create_from_commandline istället

source: SourceList: use Gtk.ListBox with the "sidebar" style class instead
es: Lista de fuentes (SourceList): utilice Gtk.ListBox con el estilo «sidebar» en su lugar
sv: SourceList: använd Gtk.ListBox med stilklassen "sidebar" istället

source: StorageBar
es: Barra de almacenamiento (StorageBar)

source: TextStyle: use style class constants instead
es: Estilo de texto (TextStyle): utilice constantes de estilos en su lugar
sv: TextStyle: använd konstanter för stilklass istället

source: Several functions in System were replaced by GLib.AppInfo
es: Varias funciones en sistema (System) fueron reemplazadas por GLib.AppInfo
sv: Flera funktioner i System har ersatts av GLib.AppInfo

source: Granite 7
sv: Granit 7

source: Granite.HyperTextView for navigatable URLs in text views
de: Granite.HyperTextView für navigierbare URLs in Textansichten

source: Fixes:
de: Fehlerbehebungen:

source: Ensure accel_to_string works with multiple modifiers
de: Sicherstellen, dass accel_to_string mit mehreren Modifikatoren funktioniert

source: Fix locale issues in Flatpaks
de: Fehlerbehebungen von Lokalisierungen in Flatpaks

source: Additions:
de: Ergänzungen:

source: TRANSITION_DURATION_IN_PLACE for consistent in-place widget transformations
de: TRANSITION_DURATION_IN_PLACE für einheitliche Widget Transformationen

source: Other Changes:
de: Weitere Änderungen:

source: accel_to_string handles accel markup without modifiers or that are only modifiers
de: accel_to_string händelt accel Markup ohne modifiers oder solche, die nur modifiers sind

source: Granite.Dialog replaces Gtk.Dialog for consistent styling
de: Granite.Dialog ersetzt Gtk.Dialog für einheitliches Styling

source: Granite.SwitchModelButton for use in Gtk.Popover menus
de: Granite.SwitchModelButton zur Benutzung in Gtk.Popover Menüs

source: Granite.ValidatedEntry for client-side verification in forms
de: Granite.ValidatedEntry für clientseitige Verifizierung in Formularen

source: New Constants:
de: Neue Konstanten:

source: TOOLTIP_SECONDARY_TEXT_MARKUP for smaller second line text in Gtk.Tooltips
de: TOOLTIP_SECONDARY_TEXT_MARKUP für kleineren Text in der zweiten Zeile in Gtk.Tooltips

source: SMALL_LABEL for smaller Gtk.Labels without Pango
de: SMALL_LABEL für kleinere Gtk.Labels ohne Pango

source: STYLE_CLASS_WARMTH and STYLE_CLASS_TEMPERATURE for scales
de: STYLE_CLASS_WARMTH und STYLE_CLASS_TEMPERATURE für Skalen

source: STYLE_CLASS_DEFAULT_DECORATION for slim headerbars
de: STYLE_CLASS_DEFAULT_DECORATION für schmale Headerbars

source: TRANSITION_DURATION_OPEN and TRANSITION_DURATION_CLOSE for consistent animations
de: TRANSITION_DURATION_OPEN und TRANSITION_DURATION_CLOSE für einheitliche Animationen

source: Granite.Widgets.AboutDialog. Provide AppStream metadata instead.
de: Granite.Widgets.AboutDialog. Stelle stattdessen AppStream Metadaten zur Verfügung.

source: Granite.Widgets.AppMenu. Use Gtk.MenuButton instead.
de: Granite.Widgets.AppMenu. Benutze stattdessen Gtk.MenuButton.

source: Granite.Widgets.Avatar. Use Hdy.Avatar instead
de: Granite.Widgets.Avatar. Benutze stattdessen Hdy.Avatar

source: Toasts now reset their timeout when sending a new notification and the timeout is stopped while hovering
de: Toasts resetten jetzt ihr Timeout wenn eine neue Benachrichtigung gesendet wird und der Timeout beim Hovern gestoppt wurde

source: Backslash, Right Control, and Left Control are now handled by accel_to_string
de: Backslash, Strg rechts und Strg links werden jetzt von accel_to_string gehändelt

source: Make tab tooltips of DynamicNotebook settable
de: Tab Tooltips von DynamicNotebook können jetzt zugewiesen werden

source: Granite.MessageDialog now uses the messagedialog CSS name
de: Granite.MessageDialog benutzt jetzt den messagedialog CSS Namen

source: Visible child name is now properly synced in Granite.SettingsSidebar
de: Visible child name wird nun korrekt in Granite.SettingsSidebar synchronisiert

source: Status can be set in Granite.AbstractSettingsPage on construct
de: Status kann nun in Granite.AbstractSettingsPage beim Aufbau gesetzt werden

source: New Style Constants:
de: Neue Style Konstanten:

source: Several theming utilities. Use Gtk.CssProvider and Gtk.StyleContext instead
de: Einige Themen-Tools. Benutzen nun Gtk.CssProvider und Gtk.StyleContext

source: Granite.Services.SimpleCommand. Use GLib.AppInfo.create_from_commandline instead
de: Granite.Services.SimpleCommand. Benutze stattdessen GLib.AppInfo.create_from_commandline

source: Old unused utilities like get_button_layout_schema, get_default_close_button_position, and Granite.Services.Paths
de: Alte, nicht mehr benutzte Tools wie get_button_layout_schema, get_default_close_button_position und Granite.Services.Paths

source: Old unused widgets like CollapsiblePaned and CompositedWindow
de: Alte, unbenutzte Widgets wie CollapsiblePaned und CompositedWindow

source: Granite.SourceList now gets Gtk.STYLE_CLASS_SIDEBAR by default
de: Granite.SourceList erhält nun standardmässig Gtk.STYLE_CLASS_SIDEBAR

source: New features:
de: Neue Funktionen:

source: New Settings class to share Pantheon desktop settings with apps
de: Neue Einstellungs-Klasse um Pantheon Desktop Einstellungen mit Apps zu teilen

source: Introduced Settings.prefers_color_scheme to get a user's color scheme preference, i.e. for a dark style
de: Führt Settings.prefers_color_scheme ein, um die Farbschema-Präferenz eines Users zu erhalten, z.B. für einen dunklen Stil

source: It is now recommended to use GLib.Settings instead of Granite.Services.Settings
de: Es ist ab jetzt empfohlen GLib.Settings anstelle von Granite.Services.Settings zu nutzen

source: Better align labels in settings sidebars
de: Labels besser an Einstellungs-Sidebars ausrichten

source: Make AccelLabel.label settable
de: AccelLabel.label zuweisbar machen

source: New features
de: Neue Funktionen

source: Add tooltips to source list items and their actions
de: Tooltips zu Source List Items und deren Aktionen zugewiesen

source: New AccelLabel widget for use in menus and popovers
de: Neues Widget AccelLabel zur Benutzung in Menüs und Popovers

source: Delay tab resizing when closing tabs
de: Verzögere Skalierung von Tabs beim Schließen
